'use strict'

// we can do map from Obj

// const mapFromObj = new Map(Object.entries(obj));

// practicing Set & Map

/*
1) Создайте массив уникальных событий "events"(события), которые произошли в игре, за все время матча.
2) После окончания матча оказалось что выдача желтой карточки на 64-ой минуте матча была ошибочка. Удалите это свойство из Map.
3) Подсчитайте среднее время появления событий с учетом того что матч идет 90 минут. Напишите результат в консоль: (Пример: Событие в этом матче, появлялось в среднем, раз в 5 мин.)
4) Переберите Map, чтобы получить в консоль результат, какие события матча происходили в первой половине и какие во второй. Результат вывода в консоли должен быть таким:
[ПЕРВАЯ ПОЛОВИНА] 17: GOAL
[ПЕРВАЯ ПОЛОВИНА] 36: Substitution ... и так далее

*/

const gameEvents = new Map([
    [17, "⚽️ GOAL"],
    [36, "🔁 Substitution"],
    [47, "⚽️ GOAL"],
    [61, "🔁 Substitution"],
    [64, "🔶 Yellow card"],
    [69, "🔴 Red card"],
    [70, "🔁 Substitution"],
    [72, "🔁 Substitution"],
    [76, "⚽️ GOAL"],
    [80, "⚽️ GOAL"],
    [92, "🔶 Yellow card"],
]);

//========================================================================================================================================================


// 1.

const events = [...new Set(gameEvents.values())];

console.log(events);

// 2.

gameEvents.delete(64);

console.log(gameEvents);

// 3.

console.log(`Every event that appeared in the match has gap around ${90 / gameEvents.size
    } minutes`);

// 4. 

for (let [min, event] of gameEvents) {
    if (min <= 45) {
        console.log(`[FIRST HALF]: ${min}: ${event}`)
    } else if (min > 45 && min <= 90) {
        console.log(`[SECOND HALF]: ${min}: ${event}`)
    } else {
        console.log(`[EVENTS AFTER MATCH]: ${min}: ${event}`)
    }
}

//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================clg
console.log('STRING!!!!___________');
// how does STRINGS work?

// lets find out!

//========================================================================================================================================================

const airplane = new String("TAP Air Portugal");

// method slice

console.log(airplane.slice(0, 10));

// how to get the first word??? EASY!

console.log(airplane.slice(0, airplane.indexOf(' ')));

// how to get the last world??? EASY!

console.log(airplane.slice(airplane.lastIndexOf(' ') + 1));

//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================


// trim, toLowerCase (toUpperCase), replace ----------

const stringVar = new String("this is the string-message bro");

console.log(stringVar.toUpperCase());

//========================================================================================================================================================

// remove SPACE - method trim();

const name = '           dima';

console.log(name);

console.log(name.trim());

//========================================================================================================================================================

// method replace

const price = '2960p';

const newPriceUSD = price.slice(0, price.length - 1) / 72 + price.replace('p', '$');

console.log((newPriceUSD));


// with method replace we can replace even WORD in the STRING
// but if we have more word, 'replace' will replace only first word that mathces
// thats why we need to use method 'replaceAll' to replace all the words that matches 

//========================================================================================================================================================

// method INCLUDES

const flyNumber = 'aB27EK107';

console.log(flyNumber.includes('EK'));

// method startsWIth()

console.log(flyNumber.startsWith('aB'));

// method endsWith()

console.log(flyNumber.endsWith('107'));


//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================

// SOME MORE STRING-METHODS - split, join etc


// with split we can make ARRAY from STRING

const newNames = 'ervin vika misha viktor jura';

const arrFromString = newNames.split(" ");

console.log(arrFromString);

// join - we can make STRING from ARRAY

const strFromArray = arrFromString.join(", ");

console.log(strFromArray);

//========================================================================================================================================================

function str(strNames) {
    const arrNames = strNames.split(" ");
    const newUpperNames = [];

    for (let item of arrNames) {
        newUpperNames.push(item[0].toUpperCase() + item.slice(1))
    }
    console.log(newUpperNames);
}

str(newNames);


//========================================================================================================================================================

// method padStart();

// const cardNumber = String(1209); 
// const cardNumber = 1209 + ""; 
const cardNumber = String(1209); 

console.log(cardNumber.padStart(16, "*"));

//========================================================================================================================================================

// method padEnd();

console.log(cardNumber.padEnd(16, "*"));

//========================================================================================================================================================

// method repeat();

console.log(cardNumber.repeat(10));

//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================

